---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsLandingStructural
source: html/b7955525-f276-3be2-ab91-cec3cde0c184.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsLandingStructural Property

"Structural": Structural

## Syntax (C#)
```csharp
public static ForgeTypeId StairsLandingStructural { get; }
```